{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 210], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "encoder", "class_name": "LSTM", "config": {"name": "encoder", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "units": 150, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "repeat_vector_1", "class_name": "RepeatVector", "config": {"name": "repeat_vector_1", "trainable": true, "dtype": "float32", "n": 10}, "inbound_nodes": [[["encoder", 0, 1, {}]], [["decoder", 0, 1, {}]], [["decoder", 1, 1, {}]], [["decoder", 2, 1, {}]], [["decoder", 3, 1, {}]], [["decoder", 4, 1, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["repeat_vector_1", 0, 0, {}], ["encoder", 0, 0, {}]], [["repeat_vector_1", 1, 0, {}], ["encoder", 0, 0, {}]], [["repeat_vector_1", 2, 0, {}], ["encoder", 0, 0, {}]], [["repeat_vector_1", 3, 0, {}], ["encoder", 0, 0, {}]], [["repeat_vector_1", 4, 0, {}], ["encoder", 0, 0, {}]], [["repeat_vector_1", 5, 0, {}], ["encoder", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]], [["concatenate_1", 1, 0, {}]], [["concatenate_1", 2, 0, {}]], [["concatenate_1", 3, 0, {}]], [["concatenate_1", 4, 0, {}]], [["concatenate_1", 5, 0, {}]]]}, {"name": "attention_weights", "class_name": "Activation", "config": {"name": "attention_weights", "trainable": true, "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["dense_1", 0, 0, {}]], [["dense_1", 1, 0, {}]], [["dense_1", 2, 0, {}]], [["dense_1", 3, 0, {}]], [["dense_1", 4, 0, {}]], [["dense_1", 5, 0, {}]]]}, {"name": "dot_1", "class_name": "Dot", "config": {"name": "dot_1", "trainable": true, "dtype": "float32", "axes": 1, "normalize": false}, "inbound_nodes": [[["attention_weights", 0, 0, {}], ["encoder", 0, 0, {}]], [["attention_weights", 1, 0, {}], ["encoder", 0, 0, {}]], [["attention_weights", 2, 0, {}], ["encoder", 0, 0, {}]], [["attention_weights", 3, 0, {}], ["encoder", 0, 0, {}]], [["attention_weights", 4, 0, {}], ["encoder", 0, 0, {}]], [["attention_weights", 5, 0, {}], ["encoder", 0, 0, {}]]]}, {"name": "decoder", "class_name": "LSTM", "config": {"name": "decoder", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "units": 150, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "inbound_nodes": [[["dot_1", 0, 0, {}], ["encoder", 0, 1, {}], ["encoder", 0, 2, {}]], [["dot_1", 1, 0, {}], ["decoder", 0, 1, {}], ["decoder", 0, 2, {}]], [["dot_1", 2, 0, {}], ["decoder", 1, 1, {}], ["decoder", 1, 2, {}]], [["dot_1", 3, 0, {}], ["decoder", 2, 1, {}], ["decoder", 2, 2, {}]], [["dot_1", 4, 0, {}], ["decoder", 3, 1, {}], ["decoder", 3, 2, {}]], [["dot_1", 5, 0, {}], ["decoder", 4, 1, {}], ["decoder", 4, 2, {}]]]}, {"name": "output", "class_name": "Dense", "config": {"name": "output", "trainable": true, "dtype": "float32", "units": 210, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["decoder", 0, 0, {}]], [["decoder", 1, 0, {}]], [["decoder", 2, 0, {}]], [["decoder", 3, 0, {}]], [["decoder", 4, 0, {}]], [["decoder", 5, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [1, 210]}, "inbound_nodes": [[["output", 0, 0, {}]], [["output", 1, 0, {}]], [["output", 2, 0, {}]], [["output", 3, 0, {}]], [["output", 4, 0, {}]], [["output", 5, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoBS9oLY29uY2F0ZW5hdGUpAdoBeKkAcgYAAAD6HjxpcHl0aG9uLWlucHV0LTEtZTU2Y2VkNTJh\nNWRjPtoIPGxhbWJkYT4WAQAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["reshape_1", 0, 0, {}], ["reshape_1", 1, 0, {}], ["reshape_1", 2, 0, {}], ["reshape_1", 3, 0, {}], ["reshape_1", 4, 0, {}], ["reshape_1", 5, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["lambda_1", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}